# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Install ZSH
brew 'zsh'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

brew 'moreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

brew 'gibo'
brew 'git'
brew 'mackup'
brew 'mas'
brew 'nvm'
brew 'tree'
brew 'wget'
brew 'z'

# Vetted Apps
cask 'anki'
cask 'calibre'
cask 'cyberduck'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'gitkraken'
cask 'google-chrome'
cask 'openemu'
cask 'selfcontrol'
cask 'simple-comic'
cask 'slack'
cask 'spotify'
cask 'telegram'
cask 'transmission'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'vlc'

# App Contenders
cask 'spectacle'

# Fonts
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-mono-for-powerline'

# Install Mac App Store apps
mas '1Password', id: 443987910
mas 'Gapplin', id: 768053424
mas 'Trello', id: 1278508951
mas 'WhatsApp', id: 1147396723