# Taps
tap 'homebrew/cask-fonts'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

brew 'moreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

brew 'gibo'
brew 'mas'
brew 'nvm'
brew 'python3'
brew 'wget'

# Vetted Apps
cask 'anki'
cask 'calibre'
cask 'cyberduck'
cask 'dash'
cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'openemu'
cask 'slack'
cask 'spotify'
cask 'telegram'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'vlc'
cask 'notion'

# App Contenders
cask 'spectacle'

# Fonts
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-mono-for-powerline'

# Install Mac App Store apps
mas 'Xcode', id: 497799835
mas '1Password', id: 1333542190
mas 'Trello', id: 1278508951
mas 'WhatsApp', id: 1147396723
mas 'Todoist: To-Do List & Tasks', id: 585829637