# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Install ZSH
brew 'zsh'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

brew 'moreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

brew 'gibo'
brew 'git'
brew 'hub'
brew 'mackup'
brew 'mas'
brew 'nvm'
brew 'trash'
brew 'tree'
brew 'wget'
brew 'yarn'
brew 'z'

# Apps
cask '1password'
cask 'anki'
cask 'calibre'
cask 'cyberduck'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'gitkraken'
cask 'google-chrome'
cask 'gyazo'
cask 'hammerspoon'
cask 'imagealpha'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2'
cask 'karabiner-elements'
cask 'key-codes'
cask 'macdown'
cask 'openemu'
cask 'selfcontrol'
cask 'simple-comic'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'telegram'
cask 'transmission'
cask 'the-unarchiver'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vlc'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-mono-for-powerline'

# Install Mac App Store apps
mas '1Password', id: 443987910
mas 'Gapplin', id: 768053424
mas 'Giphy Capture', id: 668208984
